'use strict'

//2. Завдання "Обчислення квадратного кореня":
// Запросити користувача ввести число з клавіатури.
// Використовуючи метод Math.sqrt(), обчислити квадратний корінь введеного числа.

// let num = +prompt('Введіть число: ');
// console.log(`Корінь числа ${num} = ${Math.sqrt(num)}`);

// 3. Завдання "Перевірка чи є число цілим":
// Запросити користувача ввести число з клавіатури.
// Використовуючи метод Number.isInteger(), перевірити, чи є введене число цілим.

// let num = +prompt('Введіть число: ');
// (Number.isInteger(num)) ? console.log('число ціле') : console.log('число не ціле');

//4. Завдання "Перевірка на NaN":
// Запросити у користувача ввести значення з клавіатури.
// Використовуючи функцію isNaN(), перевірити, чи є введене значення нечисловим.

// let num = +prompt('Введіть число: ');
// isNaN(num) ? console.log('Значення нечислове') : console.log('значення числове');

//5. Завдання "Перевірка на скінченність":
// Запросити у користувача ввести число з клавіатури.
// Використовуючи функцію isFinite(), перевірити, чи є введене число скінченним.

// let num = +prompt('Введіть число:');
// isFinite(num) ? console.log('Число є скінченим') : console.log('Число є не скінченим');

//6. Задати рядок, що містить числове значення.
// Використовуючи метод parseInt(), перетворити рядок у ціле число.

// let num = '256';
// console.log(parseInt(num));

//7. Завдання "Перетворення числа в рядок у восьмеричній системі числення":
// Запросити у користувача ввести число з клавіатури.
// Використовуючи метод toString(), перетворити число у рядковий формат з основою 8.

// let num = +prompt('Введіть число: ');
// console.log(num.toString(8));

//8. Завдання "Обчислення натурального логарифму числа":
// Запросити у користувача ввести число з клавіатури.
// Використовуючи метод Math.log(), обчислити натуральний логарифм введеного числа. 

// let num = +prompt('Введіть число: ');
// console.log(Math.log(num));

//9.Завдання "Обчислення степеня числа":
// Запросити у користувача ввести число та показник степеня з клавіатури.
// Використовуючи метод Math.pow(), обчислити число, піднесене до заданого показника степеня.

// let num = +prompt('Введіть число: ');
// console.log(Math.pow(num, 4));

//10. Завдання "Обчислення округленого значення числа":
// Запросити у користувача ввести десяткове число з клавіатури.
// Використовуючи метод Math.round(), обчислити округлене значення введеного числа.

// let num = +prompt('Введіть десяткове число: ');
// console.log(Math.round(num));

//11. Завдання "Обчислення довжини гіпотенузи за двома катетами":
// Запросити у користувача ввести довжину першого катета.
// Запросити у користувача ввести довжину другого катета.
// Використовуючи теорему Піфагора та метод Math.sqrt(), обчислити довжину гіпотенузи прямокутного трикутника.

// let first = +prompt('Введіть довжину першого катета:');
// let second = +prompt('Введіть довжину другого катета:');
// console.log(`Довжина гіпотенузи з катетами ${first} та ${second} = ${Math.sqrt(first**2 + second**2).toFixed(2)}`);

// 12. Завдання "Перевірка числа на скінченність та додатність":
// Запросити у користувача ввести число з клавіатури.
// Використовуючи функції isFinite() та Math.sign(), перевірити, чи є введене число скінченним та додатнім.

// let num = +prompt('Введіть число:');
// (isFinite(num) && Math.sign(num) === 1) ? console.log('Число скінчене та додатнє') : console.log('Число не скінчене та не додатнє');

//13.* Потрібно написати функцію, що виводить у консоль числа від 1 до n, де n - це ціле число, яке функція приймає як параметр, з такими умовами:
// виведення fizz замість чисел, кратних 3;
// виведення buzz замість чисел, кратних 5;
// виведення fizzbuzz замість чисел, кратних як 3, так і 5.

function fizzbuzz(num){

    for(let n = 1; n <= num; n++){
        if(n % 3 === 0 && n % 5 === 0){
            console.log('fizzbuzz');
        }else if(n % 3 === 0){
            console.log('fizz');
        }else if(n % 5 === 0){
            console.log('buzz');
        }else{
            console.log(n);
        }
    }
}
console.log(fizzbuzz(15));
